In [2]:
import pandas as pd
import numpy as np
import random

In [5]:
df = pd.read_csv("marks.csv", header = None, names = ["name", "subject", "marks"])

In [6]:
df

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0
9    Steve  Python   94.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     10 non-null     object
 1   subject  9 non-null      object
 2   marks    9 non-null      float64
dtypes: float64(1), object(2)
memory usage: 368.0+ bytes

In [8]:
df.columns

Index(['name', 'subject', 'marks'], dtype='object')

In [9]:
df.size

30

In [10]:
df.shape

(10, 3)

In [11]:
df.dtypes

name        object
subject     object
marks      float64
dtype: object

In [12]:
df.values

array([['Bill', 'Java', 90.0],
       ['Bill', 'Python', 95.0],
       ['Steve', 'Java', 80.0],
       ['Steve', 'C', 90.0],
       ['Roberts', 'HTML', 98.0],
       ['Roberts', 'Java', 60.0],
       ['Roberts', 'Python', 70.0],
       ['Steve', 'Python', nan],
       ['Henry', nan, 60.0],
       ['Steve', 'Python', 94.0]], dtype=object)

In [13]:
df.describe()

           marks
count   9.000000
mean   81.888889
std    15.053608
min    60.000000
25%    70.000000
50%    90.000000
75%    94.000000
max    98.000000

In [14]:
df.describe(include = "all")

         name subject      marks
count      10       9   9.000000
unique      4       4        NaN
top     Steve  Python        NaN
freq        4       4        NaN
mean      NaN     NaN  81.888889
std       NaN     NaN  15.053608
min       NaN     NaN  60.000000
25%       NaN     NaN  70.000000
50%       NaN     NaN  90.000000
75%       NaN     NaN  94.000000
max       NaN     NaN  98.000000

In [15]:
df.axes

[RangeIndex(start=0, stop=10, step=1),
 Index(['name', 'subject', 'marks'], dtype='object')]

In [16]:
df

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0
9    Steve  Python   94.0

In [17]:
df['subject']

0      Java
1    Python
2      Java
3         C
4      HTML
5      Java
6    Python
7    Python
8       NaN
9    Python
Name: subject, dtype: object

In [18]:
df[3:]

      name subject  marks
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0
9    Steve  Python   94.0

### *at( ), iat( ), loc( ), iloc( )*

In [19]:
df.at[9,'name']

'Steve'

In [20]:
df.iat[9,0]

'Steve'

In [21]:
df.marks > 80

0     True
1     True
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9     True
Name: marks, dtype: bool

In [22]:
df[df.marks > 80]

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
9    Steve  Python   94.0

In [23]:
df[df.marks > 80]['name']

0       Bill
1       Bill
3      Steve
4    Roberts
9      Steve
Name: name, dtype: object

In [24]:
df[df.marks > 80][['name','marks']]

      name  marks
0     Bill   90.0
1     Bill   95.0
3    Steve   90.0
4  Roberts   98.0
9    Steve   94.0

In [25]:
df.loc[8,'name']

'Henry'

In [26]:
df.loc[df.marks > 80, ['name','marks']]

      name  marks
0     Bill   90.0
1     Bill   95.0
3    Steve   90.0
4  Roberts   98.0
9    Steve   94.0

In [27]:
df[(df.subject == 'Python') & (df.marks > 80)]

    name subject  marks
1   Bill  Python   95.0
9  Steve  Python   94.0

### *head( ), tail( ), sample( )*

In [28]:
df.head()

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0

In [29]:
df.tail()

      name subject  marks
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
8    Henry     NaN   60.0
9    Steve  Python   94.0

In [30]:
df.sample()

    name subject  marks
9  Steve  Python   94.0

In [31]:
df.sample(5)

      name subject  marks
8    Henry     NaN   60.0
4  Roberts    HTML   98.0
0     Bill    Java   90.0
3    Steve       C   90.0
1     Bill  Python   95.0

In [32]:
df.loc[1:5, 'name':'marks']

      name subject  marks
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0
5  Roberts    Java   60.0

In [33]:
df.iloc[0:5]

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
3    Steve       C   90.0
4  Roberts    HTML   98.0

### *isin( ), where( ), filter( )*

In [34]:
df.subject.isin(['Python'])

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7     True
8    False
9     True
Name: subject, dtype: bool

In [35]:
df[df.subject.isin(['Python'])]

      name subject  marks
1     Bill  Python   95.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
9    Steve  Python   94.0

In [36]:
df.subject.isin(['Python', 'Java'])

0     True
1     True
2     True
3    False
4    False
5     True
6     True
7     True
8    False
9     True
Name: subject, dtype: bool

In [37]:
df[df.subject.isin(['Python', 'Java'])]

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2    Steve    Java   80.0
5  Roberts    Java   60.0
6  Roberts  Python   70.0
7    Steve  Python    NaN
9    Steve  Python   94.0

In [38]:
df.where(df.marks > 80)

      name subject  marks
0     Bill    Java   90.0
1     Bill  Python   95.0
2      NaN     NaN    NaN
3    Steve       C   90.0
4  Roberts    HTML   98.0
5      NaN     NaN    NaN
6      NaN     NaN    NaN
7      NaN     NaN    NaN
8      NaN     NaN    NaN
9    Steve  Python   94.0

In [39]:
df.filter(regex='e$')

      name
0     Bill
1     Bill
2    Steve
3    Steve
4  Roberts
5  Roberts
6  Roberts
7    Steve
8    Henry
9    Steve

### Column Operation

In [40]:
df['marks'] - 50

0    40.0
1    45.0
2    30.0
3    40.0
4    48.0
5    10.0
6    20.0
7     NaN
8    10.0
9    44.0
Name: marks, dtype: float64

### *nlargest( ), nsmallest( )*

In [41]:
df.nlargest(4, 'marks')

      name subject  marks
4  Roberts    HTML   98.0
1     Bill  Python   95.0
9    Steve  Python   94.0
0     Bill    Java   90.0

In [42]:
df.nlargest(4, 'marks', keep = 'all')

      name subject  marks
4  Roberts    HTML   98.0
1     Bill  Python   95.0
9    Steve  Python   94.0
0     Bill    Java   90.0
3    Steve       C   90.0

In [43]:
df.nsmallest(4, 'marks')

      name subject  marks
5  Roberts    Java   60.0
8    Henry     NaN   60.0
6  Roberts  Python   70.0
2    Steve    Java   80.0

In [44]:
df['name'].drop_duplicates()

0       Bill
2      Steve
4    Roberts
8      Henry
Name: name, dtype: object

In [45]:
df.subject.unique()

array(['Java', 'Python', 'C', 'HTML', nan], dtype=object)

In [46]:
df.subject.dropna().unique()

array(['Java', 'Python', 'C', 'HTML'], dtype=object)

In [53]:
df[df['name'].str.startswith('B')]

   name subject  marks
0  Bill    Java   90.0
1  Bill  Python   95.0

In [55]:
df['name'].str.upper()

0       BILL
1       BILL
2      STEVE
3      STEVE
4    ROBERTS
5    ROBERTS
6    ROBERTS
7      STEVE
8      HENRY
9      STEVE
Name: name, dtype: object